
## Plan Result (shared-snowplow-consumer-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/21837)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * local_file.shared-snowplow-consumer-app_application_ecs_service_appspec_7674CFF9


<details><summary>Change Result (Click me)</summary>

```hcl

  # local_file.shared-snowplow-consumer-app_application_ecs_service_appspec_7674CFF9 will be created
  + resource "local_file" "shared-snowplow-consumer-app_application_ecs_service_appspec_7674CFF9" {
      + content              = jsonencode(
            {
              + Resources = [
                  + {
                      + TargetService = {
                          + Properties = {
                              + LoadBalancerInfo = {
                                  + ContainerName = "app"
                                  + ContainerPort = 4015
                                }
                              + TaskDefinition   = "arn:aws:ecs:us-east-1:996905175585:task-definition/SharedSnowplowConsumer-Prod:78"
                            }
                          + Type       = "AWS::ECS::Service"
                        }
                    },
                ]
              + version   = 1
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "appspec.json"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobID":"4ed1d3f9-34b6-46b6-b231-40e84be5372f","JobName":"shared-snowplow-consumer_infrastructure_plan_prod","PRNumber":94,"Program":"tfcmt","SHA1":"f3db548d15c6cb0bdd2a9a03707a1e9c8b4095cb","Target":"shared-snowplow-consumer-cdk","Vars":{}} -->